Repository: RamiAsad1/workout_tracker_flutter_app
Catalog: lib/l10n/app_*.arb
Languages: ar

# historyLabel
source: History
ar: التاريخ

# workoutLabel
source: Workouts
ar: التمارين

# settingsLabel
source: Settings
ar: الإعدادات

# exerciseLoadError
source: Failed to load exercises
ar: فشل تحميل التمارين

# exerciseAddError
source: Failed to add exercise
ar: فشل إضافة التمرين

# exerciseDeleteError
source: Failed to delete exercise
ar: فشل حذف التمرين

# exerciseUpdateError
source: Failed to update exercise
ar: فشل تحديث التمرين

# workoutLoadError
source: Failed to load workouts
ar: فشل تحميل التمارين الرياضية

# workoutAddError
source: Failed to add workout
ar: فشل إضافة التمرين الرياضي

# workoutDeleteError
source: Failed to delete workout
ar: فشل حذف التمرين الرياضي

# workoutUpdateError
source: Failed to update workout
ar: فشل تحديث التمرين الرياضي

# searchBarHint
source: Search exercises...
ar: ابحث عن تمارين...

# allExercisesLabel
source: All Exercises
ar: جميع التمارين

# noExercisesFoundErrorMessage
source: No exercises found
ar: لم يتم العثور على تمارين

# myWorkoutsLabel
source: My Workouts
ar: تماريني

# noWorkoutsFoundErrorMessage
source: You have no workouts yet. Start by adding some exercises!
ar: ليس لديك تمارين بعد. ابدأ بإضافة بعض التمارين!

# lastSessionLabel
source: Last session was: {date}
ar: الجلسة الأخيرة كانت: {date}

# addWorkoutLabel
source: Add Workout
ar: إضافة تمرين رياضي

# workoutNameLabel
source: Workout Name
ar: اسم التمرين

# workoutNameError
source: Enter a workout name
ar: أدخل اسمًا للتمرين

# workoutNotesLabel
source: Notes
ar: ملاحظات

# addExerciseBtnLabel
source: Add Exercise
ar: إضافة تمرين

# saveWorkoutBtnLabel
source: Save
ar: حفظ

# exerciseAddedLabel
source: Exercise added
ar: تمت إضافة التمرين

# exerciseDeletedLabel
source: Exercise deleted
ar: تم حذف التمرين

# workoutSavedLabel
source: Workout saved
ar: تم حفظ التمرين الرياضي

# workoutDeletedLabel
source: Workout deleted
ar: تم حذف التمرين الرياضي
